app/controllers/cards_controller.rb

  def load_collection
    @collection = Collection.find(params[:collection_id])
---
SELECT * FROM `collections` WHERE (`collections`.`id` = 2)

  def index
    @cards = @collection.cards.all
---
SELECT * FROM `cards` WHERE (`cards`.collection_id = 1)

  def show
    @card = @collection.cards.find(params[:id])
---
SELECT * FROM `cards` WHERE (`cards`.`id` = 1 AND (`cards`.collection_id = 1))

  def edit
    @card = @collection.cards.find(params[:id])
---
SELECT * FROM `cards` WHERE (`cards`.`id` = 1 AND (`cards`.collection_id = 1))

  def create
    @card = @collection.cards.build(params[:card])

    respond_to do |format|
      if @card.save
---
INSERT INTO `cards` (`created_at`, `title`, `body`, `updated_at`, `collection_id`) VALUES('2010-06-02 21:39:03', 'this is the stuf', '', '2010-06-02 21:39:03', 1)

  def update
    @card = @collection.cards.find(params[:id])

    respond_to do |format|
      if @card.update_attributes(params[:card])
---
SELECT * FROM `cards` WHERE (`cards`.`id` = 1 AND (`cards`.collection_id = 1))
UPDATE `cards` SET `updated_at` = '2010-06-06 00:03:15', `body` = 'Here is the body of all the things you want to have a body for\r\n' WHERE `id` = 1

  def destroy
    @card = @collection.cards.find(params[:id])
    @card.destroy
---
SELECT * FROM `cards` WHERE (`cards`.`id` = 3 AND (`cards`.collection_id = 2))
DELETE FROM `cards` WHERE `id` = 3